devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
/*=========================================================================*//**
@file    sdspi.c

@author  Daniel Zorychta

@brief   This file support SD in SPI mode

@note    Copyright (C) 2013 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the  Free Software  Foundation;  either version 2 of the License, or
         any later version.

         This  program  is  distributed  in the hope that  it will be useful,
         but  WITHOUT  ANY  WARRANTY;  without  even  the implied warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         You  should  have received a copy  of the GNU General Public License
         along  with  this  program;  if not,  write  to  the  Free  Software
         Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.


*//*==========================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "core/module.h"
#include <dnx/thread.h>
#include <dnx/os.h>
#include <dnx/timer.h>
#include <dnx/misc.h>
#include <unistd.h>
#include "stm32f1/sdspi_cfg.h"
#include "stm32f1/sdspi_def.h"
#include "stm32f1/stm32f10x.h"

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/
#define MTX_BLOCK_TIME                                  0
#define MTX_BLOCK_TIME_LONG                             200
#define RELEASE_TIMEOUT_MS                              1000

/* DMA and SPI automatic configuration */
#if (SDSPI_PORT == 1)
#define SPI_PORT                                        SPI1
#define SDSPI_DMA                                       DMA1
#define SDSPI_DMA_TX_CHANNEL                            DMA1_Channel3
#define SDSPI_DMA_TX_CHANNEL_NO                         3
#define SDSPI_DMA_RX_CHANNEL                            DMA1_Channel2
#define SDSPI_DMA_RX_CHANNEL_NO                         2
#define SDSPI_DMA_IRQ_ROUTINE                           DMA1_Channel2_IRQHandler
#define SDSPI_DMA_IRQ_NUMBER                            DMA1_Channel2_IRQn
#define SDSPI_DMA_ENABLE                                RCC_AHBENR_DMA1EN
#define RCC_APBxRSTR                                    RCC->APB2RSTR
#define RCC_APBxENR                                     RCC->APB2ENR
#define RCC_APBxRSTR_SPIxRST                            RCC_APB2RSTR_SPI1RST
#define RCC_APBxENR_SPIxEN                              RCC_APB2ENR_SPI1EN
#elif (SDSPI_PORT == 2)
#define SPI_PORT                                        SPI2
#define SDSPI_DMA                                       DMA1
#define SDSPI_DMA_TX_CHANNEL                            DMA1_Channel5
#define SDSPI_DMA_TX_CHANNEL_NO                         5
#define SDSPI_DMA_RX_CHANNEL                            DMA1_Channel4
#define SDSPI_DMA_RX_CHANNEL_NO                         4
#define SDSPI_DMA_IRQ_ROUTINE                           DMA1_Channel4_IRQHandler
#define SDSPI_DMA_IRQ_NUMBER                            DMA1_Channel4_IRQn
#define SDSPI_DMA_ENABLE                                RCC_AHBENR_DMA1EN
#define RCC_APBxRSTR                                    RCC->APB1RSTR
#define RCC_APBxENR                                     RCC->APB1ENR
#define RCC_APBxRSTR_SPIxRST                            RCC_APB1RSTR_SPI2RST
#define RCC_APBxENR_SPIxEN                              RCC_APB1ENR_SPI2EN
#elif (SDSPI_PORT == 3)
#define SPI_PORT                                        SPI3
#define SDSPI_DMA                                       DMA2
#define SDSPI_DMA_TX_CHANNEL                            DMA2_Channel2
#define SDSPI_DMA_TX_CHANNEL_NO                         2
#define SDSPI_DMA_RX_CHANNEL                            DMA2_Channel1
#define SDSPI_DMA_RX_CHANNEL_NO                         1
#define SDSPI_DMA_IRQ_ROUTINE                           DMA2_Channel1_IRQHandler
#define SDSPI_DMA_IRQ_NUMBER                            DMA2_Channel1_IRQn
#define SDSPI_DMA_ENABLE                                RCC_AHBENR_DMA2EN
#define RCC_APBxRSTR                                    RCC->APB1RSTR
#define RCC_APBxENR                                     RCC->APB1ENR
#define RCC_APBxRSTR_SPIxRST                            RCC_APB1RSTR_SPI3RST
#define RCC_APBxENR_SPIxEN                              RCC_APB1ENR_SPI3EN
#else
#error Wrong SPI port!
#endif

/* MBR definitions */
#define MBR_BOOTSTRAP_CODE_OFFSET                       0x000
#define MBR_PARTITION_1_ENTRY_OFFSET                    0x1BE
#define MBR_PARTITION_2_ENTRY_OFFSET                    0x1CE
#define MBR_PARTITION_3_ENTRY_OFFSET                    0x1DE
#define MBR_PARTITION_4_ENTRY_OFFSET                    0x1EE
#define MBR_BOOT_SIGNATURE_OFFSET                       0x1FE

#define MBR_PARITION_ENTRY_STATUS_OFFSET                0x00
#define MBR_PARITION_ENTRY_CHS_FIRST_ADDR_OFFSET        0x01
#define MBR_PARITION_ENTRY_PARTITION_TYPE_OFFSET        0x04
#define MBR_PARITION_ENTRY_CHS_LAST_ADDR_OFFSET         0x05
#define MBR_PARITION_ENTRY_LBA_FIRST_ADDR_OFFSET        0x08
#define MBR_PARITION_ENTRY_NUM_OF_SECTORS_OFFSET        0x0C

/*==============================================================================
  Local types, enums definitions
==============================================================================*/
/** card command definitions */
typedef enum {
        CMD0            = (0x40+0 ),    /* GO_IDLE_STATE */
        CMD1            = (0x40+1 ),    /* SEND_OP_COND (MMC) */
        ACMD41          = (0xC0+41),    /* SEND_OP_COND (SDC) */
        CMD8            = (0x40+8 ),    /* SEND_IF_COND */
        CMD9            = (0x40+9 ),    /* SEND_CSD */
        CMD10           = (0x40+10),    /* SEND_CID */
        CMD12           = (0x40+12),    /* STOP_TRANSMISSION */
        ACMD13          = (0xC0+13),    /* SD_STATUS (SDC) */
        CMD16           = (0x40+16),    /* SET_BLOCKLEN */
        CMD17           = (0x40+17),    /* READ_SINGLE_BLOCK */
        CMD18           = (0x40+18),    /* READ_MULTIPLE_BLOCK */
        CMD23           = (0x40+23),    /* SET_BLOCK_COUNT (MMC) */
        ACMD23          = (0xC0+23),    /* SET_WR_BLK_ERASE_COUNT (SDC) */
        CMD24           = (0x40+24),    /* WRITE_BLOCK */
        CMD25           = (0x40+25),    /* WRITE_MULTIPLE_BLOCK */
        CMD55           = (0x40+55),    /* APP_CMD */
        CMD58           = (0x40+58)     /* READ_OCR */
} card_cmd_t;

/** card types */
typedef struct {
        enum {
                        CT_UNKNOWN,
                        CT_MMC,
                        CT_SD1,
                        CT_SD2
        }               type  : 2;
        bool            block : 1;
} card_type;

