devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
/** device structure */
typedef struct {
        u32_t           first_sector;   /* sector number              */
        u32_t           size;           /* in sectors                 */
        bool            used;           /* true if part used          */
        u8_t            major;          /* device major number        */
        u8_t            minor;          /* device minor number        */
} sdpart_t;

/** main control structure */
typedef struct {
        mutex_t        *card_protect_mtx;
        sdpart_t       *part[5];
        card_type       card_type;
        bool            card_initialized;
#if (SDSPI_ENABLE_DMA != 0)
        volatile bool   DMA_tansaction_finished;
#endif
} sdctrl_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/
static void             spi_turn_on_clock                       (void);
static void             spi_turn_off_clock                      (void);
static void             spi_configure                           (void);
static void             spi_select_card                         (void);
static void             spi_deselect_card                       (void);
static void             spi_configure_DMA                       (bool enable);
static void             spi_enable_Tx_Rx_DMA                    (void);
static void             spi_disable_Tx_Rx_DMA                   (void);
static bool             spi_is_rx_buffer_not_empty              (void);
static void             spi_send_data                           (u8_t data);
static u8_t             spi_get_data                            (void);
static u8_t             spi_transmit                            (u8_t out);
static u8_t             card_send_cmd                           (sdpart_t *hdl, card_cmd_t cmd, u32_t arg);
static u8_t             card_wait_ready                         (void);
static bool             card_receive_data_block                 (u8_t *buff);
static bool             card_transmit_data_block                (const u8_t *buff, u8_t token);
static ssize_t          card_read_whole_sectors                 (sdpart_t *hdl, void *dst, size_t nsectors, u64_t lseek);
static ssize_t          card_read_partial_sectors               (sdpart_t *hdl, void *dst, size_t size, u64_t lseek);
static ssize_t          card_write_whole_sectors                (sdpart_t *hdl, const void *src, size_t nsectors, u64_t lseek);
static ssize_t          card_write_partial_sectors              (sdpart_t *hdl, const void *src, size_t size, u64_t lseek);
static stdret_t         card_initialize                         (sdpart_t *hdl);
static ssize_t          card_read                               (sdpart_t *hdl, u8_t *dst, size_t count, u64_t lseek);
static ssize_t          card_write                              (sdpart_t *hdl, const u8_t *src, size_t count, u64_t lseek);
static u16_t            mbr_get_boot_signature                  (u8_t *sector);
static u32_t            mbr_get_partition_first_LBA_sector      (int partition, u8_t *sector);
static u32_t            mbr_get_partition_number_of_sectors     (int partition, u8_t *sector);
static stdret_t         mbr_detect_partitions                   (sdpart_t *hdl);

/*==============================================================================
  Local object definitions
==============================================================================*/
MODULE_NAME("SDSPI");

static sdctrl_t   *sdspi_ctrl;
static const u16_t sector_size = 512;

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_INIT(SDSPI, void **device_handle, u8_t major, u8_t minor)
{
        if (major != _SDSPI_CARD_0 || minor > _SDSPI_PARTITION_4) {
                errno = EINVAL;
                return STD_RET_ERROR;
        }

        if (sdspi_ctrl == NULL) {
                if (RCC_APBxENR & RCC_APBxENR_SPIxEN) {
                        errno = EADDRINUSE;
                        return STD_RET_ERROR;
                }

                sdctrl_t *sdspi = calloc(1, sizeof(sdctrl_t));
                mutex_t  *mtx   = mutex_new(MUTEX_NORMAL);

                if (sdspi && mtx) {
                        spi_turn_on_clock();
                        spi_configure();
                        spi_configure_DMA(true);

                        sdspi->card_protect_mtx = mtx;
                        sdspi_ctrl              = sdspi;

                } else {
                        if (sdspi)
                                free(sdspi);

                        if (mtx)
                                mutex_delete(mtx);

                        return STD_RET_ERROR;
                }
        }

        if (sdspi_ctrl) {
                sdpart_t *part = calloc(1, sizeof(sdpart_t));
                if (part) {
                        part->first_sector      = 0;
                        part->size              = 0;
                        part->major             = major;
                        part->minor             = minor;

                        sdspi_ctrl->part[minor] = part;

                        *device_handle          = part;

                        return STD_RET_OK;
                }
        }

        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_RELEASE(SDSPI, void *device_handle)
{
        sdpart_t *part = device_handle;

        timer_t timer = timer_reset();
        while (part->used) {
                if (timer_is_expired(timer, RELEASE_TIMEOUT_MS)) {
                        errno = EBUSY;
                        return STD_RET_ERROR;
                }

