devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
                sleep_ms(10);
        }

        critical_section_begin();
        sdspi_ctrl->part[part->minor] = NULL;

        part->first_sector = 0;
        part->size         = 0;
        part->used         = false;
        part->minor        = 0;

        free(part);

        if (  sdspi_ctrl->part[_SDSPI_FULL_VOLUME] == NULL
           && sdspi_ctrl->part[_SDSPI_PARTITION_1] == NULL
           && sdspi_ctrl->part[_SDSPI_PARTITION_2] == NULL
           && sdspi_ctrl->part[_SDSPI_PARTITION_3] == NULL
           && sdspi_ctrl->part[_SDSPI_PARTITION_4] == NULL  ) {

                mutex_delete(sdspi_ctrl->card_protect_mtx);
                sdspi_ctrl->card_initialized = false;
                sdspi_ctrl->card_protect_mtx = NULL;
                free(sdspi_ctrl);

                spi_turn_off_clock();
                spi_configure_DMA(false);
        }

        critical_section_end();

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_OPEN(SDSPI, void *device_handle, vfs_open_flags_t flags)
{
        UNUSED_ARG(flags);

        sdpart_t *part = device_handle;

        if (part->used == true) {
                errno = EBUSY;
                return STD_RET_ERROR;
        } else {
                return STD_RET_OK;
        }
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_CLOSE(SDSPI, void *device_handle, bool force)
{
        UNUSED_ARG(force);

        sdpart_t *part = device_handle;

        part->used = false;

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[in ]           fattr                  file attributes
 *
 * @return number of written bytes, -1 if error
 */
//==============================================================================
API_MOD_WRITE(SDSPI, void *device_handle, const u8_t *src, size_t count, fpos_t *fpos, struct vfs_fattr fattr)
{
        UNUSED_ARG(fattr);

        sdpart_t *part = device_handle;

        ssize_t n = -1;
        if (part->size > 0) {
                if (mutex_lock(sdspi_ctrl->card_protect_mtx, MAX_DELAY_MS)) {
                        n = card_write(part, src, count, *fpos + ((u64_t)part->first_sector * sector_size));
                        mutex_unlock(sdspi_ctrl->card_protect_mtx);
                } else {
                        errno = EBUSY;
                }
        } else {
                errno = ENOMEDIUM;
        }

        return n;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[in ]           fattr                  file attributes
 *
 * @return number of read bytes, -1 if error
 */
//==============================================================================
API_MOD_READ(SDSPI, void *device_handle, u8_t *dst, size_t count, fpos_t *fpos, struct vfs_fattr fattr)
{
        UNUSED_ARG(fattr);

        sdpart_t *part = device_handle;

        ssize_t n = -1;
        if (part->size > 0) {
                if (mutex_lock(sdspi_ctrl->card_protect_mtx, MAX_DELAY_MS)) {
                        n = card_read(part, dst, count, *fpos + ((u64_t)part->first_sector * sector_size));
                        mutex_unlock(sdspi_ctrl->card_protect_mtx);
                } else {
                        errno = EBUSY;
                }
        } else {
                errno = ENOMEDIUM;
        }

        return n;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_IOCTL(SDSPI, void *device_handle, int request, void *arg)
{
        sdpart_t *part = device_handle;

        stdret_t status = STD_RET_OK;

        switch (request) {
        case IOCTL_SDSPI__INITIALIZE_CARD:
                if (mutex_lock(sdspi_ctrl->card_protect_mtx, MTX_BLOCK_TIME)) {
                        bool *result = arg;

                        if (result) {
                                *result = false;
                        }

                        if (card_initialize(part) == STD_RET_OK) {
                                /*
                                 * This function set Card Initialization Success
                                 * even if in the card there are not any partitions
                                 */
                                if (result) {
                                        *result = true;
                                }

