devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
        spi_enable_Tx_Rx_DMA();

        while (sdspi_ctrl->DMA_tansaction_finished == false);

#else
        /* memory alignment */
        int size = sector_size;
        do {
                *buff++ = spi_transmit(0xFF);
                *buff++ = spi_transmit(0xFF);
                *buff++ = spi_transmit(0xFF);
                *buff++ = spi_transmit(0xFF);
        } while (size -= 4);
#endif

        /* discard CRC */
        spi_transmit(0xFF);
        spi_transmit(0xFF);

        return true;
}

//==============================================================================
/**
 * @brief Function transmit data block
 *
 * @param[in] *buff             source buffer (sector size)
 * @param[in]  toke             token to send
 *
 * @retval true if success
 * @retval false if error
 */
//==============================================================================
static bool card_transmit_data_block(const u8_t *buff, u8_t token)
{
        if (card_wait_ready() != 0xFF) {
                errno = EIO;
                return false;
        }

        spi_transmit(token);

        if (token != 0xFD) {
#if (SDSPI_ENABLE_DMA != 0)
                u16_t dummy;
                SDSPI_DMA_RX_CHANNEL->CMAR  = (u32_t)&dummy;
                SDSPI_DMA_RX_CHANNEL->CPAR  = (u32_t)&SPI_PORT->DR;
                SDSPI_DMA_RX_CHANNEL->CNDTR = sector_size;
                SDSPI_DMA_RX_CHANNEL->CCR   = DMA_CCR1_TCIE | DMA_CCR1_EN;
                NVIC_EnableIRQ(SDSPI_DMA_IRQ_NUMBER);

                SDSPI_DMA_TX_CHANNEL->CMAR  = (u32_t)buff;
                SDSPI_DMA_TX_CHANNEL->CPAR  = (u32_t)&SPI_PORT->DR;
                SDSPI_DMA_TX_CHANNEL->CNDTR = sector_size;
                SDSPI_DMA_TX_CHANNEL->CCR   = DMA_CCR1_MINC | DMA_CCR1_DIR | DMA_CCR1_EN;

                sdspi_ctrl->DMA_tansaction_finished = false;

                spi_enable_Tx_Rx_DMA();

                while (sdspi_ctrl->DMA_tansaction_finished == false);

#else
                int size = sector_size;
                do {
                        spi_transmit(*buff++);
                        spi_transmit(*buff++);
                        spi_transmit(*buff++);
                        spi_transmit(*buff++);
                } while (size -= 4);
#endif

                /* CRC dummy */
                spi_transmit(0xFF);
                spi_transmit(0xFF);

                /* receive data response */
                if ((spi_transmit(0xFF) & 0x1F) != 0x05) {
                        errno = EIO;
                        return false;
                }
        }

        return true;
}

//==============================================================================
/**
 * @brief Function read whole sectors
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *dst             destination
 * @param[in]   nsectors        sectors to read
 * @param[in]   lseek           file index
 *
 * @retval number of read sectors
 */
//==============================================================================
static ssize_t card_read_whole_sectors(sdpart_t *hdl, void *dst, size_t nsectors, u64_t lseek)
{
        if (sdspi_ctrl->card_type.block) {
                lseek >>= 9;    /* divide by 512 */
        }

        /* 1 sector to read */
        ssize_t n = -1;
        if (nsectors == 1) {
                if (card_send_cmd(hdl, CMD17, (u32_t)lseek) == 0) {
                        if (card_receive_data_block(dst)) {
                                n = 1;
                        }
                }
        } else {
                if (card_send_cmd(hdl, CMD18, (u32_t)lseek) == 0) {
                        n = 0;
                        do {
                                if (!card_receive_data_block(dst)) {
                                        break;
                                }

                                dst += sector_size;
                        } while (++n < (ssize_t)nsectors);

                        /* stop transmission */
                        card_send_cmd(hdl, CMD12, 0);
                }
        }

        return n;
}

//==============================================================================
/**
 * @brief Function read only selected data from sectors
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *dst             destination
 * @param[in]   size            number of bytes to read
 * @param[in]   lseek           file index
 *
 * @retval number of read bytes
 */
//==============================================================================
static ssize_t card_read_partial_sectors(sdpart_t *hdl, void *dst, size_t size, u64_t lseek)
{
        u8_t *buffer = malloc(sector_size);
        if (!buffer)
                return -1;

        u32_t recv_data = 0;
        while (recv_data < size) {
                if (lseek % sector_size == 0 && (size - recv_data) / sector_size > 0) {
                        ssize_t n = card_read_whole_sectors(hdl, dst, size / sector_size, lseek);
                        if (n == -1) {
                                recv_data = -1;
                                goto exit;
                        } else if (n != (ssize_t)size / sector_size) {
                                break;
                        }

                        dst       += n * sector_size;
                        lseek     += n * sector_size;
                        recv_data += n * sector_size;
                } else {
                        ssize_t n = card_read_whole_sectors(hdl, buffer, 1, lseek & ~(0x1FF));
                        if (n == -1) {
                                recv_data = -1;
                                goto exit;
                        } else if (n != 1) {
                                break;
                        }

                        u32_t rest;
                        if ((sector_size - (lseek % sector_size)) > (size - recv_data))
                                rest = size - recv_data;
                        else
                                rest = sector_size - (lseek % sector_size);

