devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
                        memcpy(dst, buffer + (lseek % sector_size), rest);
                        dst       += rest;
                        recv_data += rest;
                        lseek     += rest;
                }
        }

exit:
        free(buffer);

        return recv_data;
}

//==============================================================================
/**
 * @brief Function write whole sectors
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *src             source
 * @param[in]   nsectors        sectors to read
 * @param[in]   lseek           file index
 *
 * @retval number of written sectors
 */
//==============================================================================
static ssize_t card_write_whole_sectors(sdpart_t *hdl, const void *src, size_t nsectors, u64_t lseek)
{
        if (sdspi_ctrl->card_type.block) {
                lseek >>= 9;    /* divide by 512 */
        }

        /* 1 sector to read */
        ssize_t n = -1;
        if (nsectors == 1) {
                if (card_send_cmd(hdl, CMD24, (u32_t)lseek) == 0) {
                        if (card_transmit_data_block(src, 0xFE)) {
                                n = 1;
                        }
                }
        } else {
                if (sdspi_ctrl->card_type.type == CT_SD1 || sdspi_ctrl->card_type.type == CT_SD2) {
                        card_send_cmd(hdl, ACMD23, nsectors);
                }

                if (card_send_cmd(hdl, CMD25, (u32_t)lseek) == 0) {
                        n = 0;
                        do {
                                if (!card_transmit_data_block(src, 0xFC)) {
                                        break;
                                }

                                src += sector_size;
                        } while (++n < (ssize_t)nsectors);

                        /* stop transmission */
                        if (!card_transmit_data_block(NULL, 0xFD)) {
                                n = 0;
                        }
                }
        }

        return n;
}

//==============================================================================
/**
 * @brief Function write only selected data to sectors
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *src             source
 * @param[in]   size            number of bytes to read
 * @param[in]   lseek           file index
 *
 * @retval number of written bytes
 */
//==============================================================================
static ssize_t card_write_partial_sectors(sdpart_t *hdl, const void *src, size_t size, u64_t lseek)
{
        u8_t *buffer = malloc(sector_size);
        if (!buffer)
                return -1;

        u32_t transmit_data = 0;
        while (transmit_data < size) {
                if (lseek % sector_size == 0 && (size - transmit_data) / sector_size > 0) {
                        ssize_t n = card_write_whole_sectors(hdl, src, size / sector_size, lseek);
                        if (n == -1) {
                                transmit_data = -1;
                                goto exit;
                        } else if (n != (ssize_t)size / sector_size) {
                                break;
                        }

                        src           += n * sector_size;
                        lseek         += n * sector_size;
                        transmit_data += n * sector_size;
                } else {
                        ssize_t n = card_read_whole_sectors(hdl, buffer, 1, lseek & ~(0x1FF));
                        if (n == -1) {
                                transmit_data = -1;
                                goto exit;
                        } else if (n != 1) {
                                break;
                        }

                        u32_t rest;
                        if ((sector_size - (lseek % sector_size)) > (size - transmit_data))
                                rest = size - transmit_data;
                        else
                                rest = sector_size - (lseek % sector_size);

                        memcpy(buffer + (lseek % sector_size), src, rest);

                        n = card_write_whole_sectors(hdl, buffer, 1, lseek & ~(0x1FF));
                        if (n == -1) {
                                transmit_data = -1;
                                goto exit;
                        } else if (n != 1) {
                                break;
                        }

                        src           += rest;
                        transmit_data += rest;
                        lseek         += rest;
                }
        }

exit:
        free(buffer);

        return transmit_data;
}

//==============================================================================
/**
 * @brief Function initialize card
 *
 * @param[in] *hdl      SD module data
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t card_initialize(sdpart_t *hdl)
{
        spi_deselect_card();
        for (int n = 0; n < 50; n++) {
                spi_transmit(0xFF);
        }

        sdspi_ctrl->card_type.type   = CT_UNKNOWN;
        sdspi_ctrl->card_type.block  = false;
        sdspi_ctrl->card_initialized = false;

        timer_t timer = timer_reset();

        if (card_send_cmd(hdl, CMD0, 0) == 0x01) {
                if (card_send_cmd(hdl, CMD8, 0x1AA) == 0x01) { /* check SDHC card */
                        u8_t OCR[4];

                        for (int n = 0; n < 4; n++) {
                                OCR[n] = spi_transmit(0xFF);
                        }

                        if (OCR[2] == 0x01 && OCR[3] == 0xAA) {
                                while ( timer_is_not_expired(timer, SDSPI_TIMEOUT)
                                      && card_send_cmd(hdl, ACMD41, 1UL << 30) ) {

                                        sleep_ms(1);
                                }

                                if ( !timer_is_expired(timer, SDSPI_TIMEOUT)
                                   && card_send_cmd(hdl, CMD58, 0) == 0 ) {

                                        for (int n = 0; n < 4; n++) {
                                                OCR[n] = spi_transmit(0xFF);
                                        }

                                        sdspi_ctrl->card_type.type   = CT_SD2;
                                        sdspi_ctrl->card_type.block  = (OCR[0] & 0x40) ? true : false;

                                        sdspi_ctrl->card_initialized = true;
                                }
                        }
                } else { /* SDSC or MMC */
                        u8_t cmd;
                        if (card_send_cmd(hdl, ACMD41, 0) <= 0x01)   {
                                sdspi_ctrl->card_type.type = CT_SD1;
                                cmd = ACMD41;   /* SDSC */
                        } else {
                                sdspi_ctrl->card_type.type = CT_MMC;
                                cmd = CMD1;     /* MMC */
                        }

                        /* Wait for leaving idle state */
                        while (!timer_is_expired(timer, SDSPI_TIMEOUT) && card_send_cmd(hdl, cmd, 0)) {
                                sleep_ms(1);
                        }

