devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
}

//==============================================================================
/**
 * @brief Function detect partitions
 *
 * @param[in] *hdl      SD module data
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t mbr_detect_partitions(sdpart_t *hdl)
{
        stdret_t status = STD_RET_ERROR;

        u8_t *MBR = malloc(sector_size);
        if (MBR) {
                if (card_read(hdl, MBR, sector_size, 0) != sector_size) {
                        goto error;
                }

                if (mbr_get_boot_signature(MBR) != 0xAA55) {
                        errno = EMEDIUMTYPE;
                        goto error;
                }

                for (int i = _SDSPI_PARTITION_1; i <= _SDSPI_PARTITION_4; i++) {
                        u32_t size = mbr_get_partition_number_of_sectors(i, MBR);
                        if (size > 0 && sdspi_ctrl->part[i]) {
                                sdspi_ctrl->part[i]->size         = size;
                                sdspi_ctrl->part[i]->first_sector = mbr_get_partition_first_LBA_sector(i, MBR);
                        }
                }

                status = STD_RET_OK;
error:
                free(MBR);
        }

        return status;
}

//==============================================================================
/**
 * @brief DMA operation finish interrupt
 */
//==============================================================================
#if (SDSPI_ENABLE_DMA != 0)
void SDSPI_DMA_IRQ_ROUTINE(void)
{
        spi_disable_Tx_Rx_DMA();
        SDSPI_DMA_RX_CHANNEL->CCR = 0x00;
        SDSPI_DMA_TX_CHANNEL->CCR = 0x00;

        NVIC_DisableIRQ(SDSPI_DMA_IRQ_NUMBER);

        SDSPI_DMA->IFCR = DMA_IFCR_CTCIF1 << (4 * (SDSPI_DMA_RX_CHANNEL_NO - 1));

        sdspi_ctrl->DMA_tansaction_finished = true;
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
